/**
 * @author Igor Frolov <moodtraffic@gmail.com>
 *
 * Задание контрольной работы
 * --------------------------
 * Написать программу, которая из имеющегося массива строк формирует массив из строк,
 * длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры,
 * либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями,
 * лучше обойтись исключительно массивами.
 *
 * Техническое решение описано в README.md
 */

// 1 - начало и инициализация начальных переменных

// 2 - загрузка данных из файла

// 3 - основной алгоритм:

// 3.1 -- обход исходного массива строк, с целью запомнить индексы элементов,
// для которых выполняется условие - длина строки меньше либо равно 3 и запоминание кол-ва таких элементов

// 3.2 -- копирование из исходного массива элементов в результирующий массив

// 4 - вывод начального и результирующего массивов и заверешение
